       01  STATS.
           03  STAT               PIC  X(03).
           03  LOSS               PIC  9(03)V99.
           03  GAIN               PIC  9(03)V99.
           03  FILLER             PIC  X(17).
